/* knl_core.h                                           */
/********************************************************/
/* object    | カーネルコアヘッダ                       */
/* abstract  | カーネルコア制御                         */
/* edit his  | 2026/01/26 新規作成                      */
/*           |                                          */
/********************************************************/
#ifndef KNL_CORE_H
#define KNL_CORE_H

/********************************************************/
/* インクルード                                        */
/********************************************************/


/********************************************************/
/* 外部公開定義                                         */
/********************************************************/

extern TCB tcb_tbl[];      /* TCBテーブル */
extern TCB *ready_queue[]; /* タスクの実行待ち行列 */
extern TCB *cur_task;      /* 実行中のタスク */
extern TCB *sche_task;     /* 次に実行するタスク */
extern TCB *wait_queue;    /* タスクの時間待ち行列 */

extern void scheduler( void ); /* スケジューラ */

#endif
/********************************************************/
/* EOF                                                  */
/********************************************************/
