/* ﾒﾓﾒﾓ:OSAPIとmcu依存が混ざっているため分離するべき．  */
/* apidef.h                                             */
/********************************************************/
/* object    | API定義ヘッダー                          */
/* abstract  | APIに用いる定義                          */
/* edit his  | 2025/12/16 新規作成                      */
/*           |                                          */
/********************************************************/
#ifndef APIDEF_H
#define APIDEF_H

/********************************************************/
/* 外部公開定義                                         */
/********************************************************/






/* タスクの待ち属性 */
#define TA_TFIFO     0x00000000 /* 待機をFIFO管理 */
#define TA_TPRI      0x00000001 /* 待機を優先度管理 */
#define TA_FIRST     0x00000000 /* 待機行列タスク優先 */
#define TA_CNT       0x00000002 /* 要求数少タスク優先 */
#define TA_WSGL      0x00000000 /* 複数タスク待機禁止 */
#define TA_WMUL      0x00000008 /* 複数タスク待機許可 */













#endif






/********************************************************/
/* EOF                                                  */
/********************************************************/
