/* ﾒﾓﾒﾓ:OSAPIとMCU依存を分離すべき */
/* knldef.h                                             */
/********************************************************/
/* object    | カーネル内部共通定義ヘッダ               */
/* abstract  | カーネル内部共通定義                     */
/* edit his  | 2025/12/17 新規作成                      */
/*           |                                          */
/********************************************************/
#ifndef KNLDEF_H
#define KNLDEF_H

/********************************************************/
/* 外部公開定義                                         */
/********************************************************/

 



extern void Reset_Handler( void );    /*リセットハンドラ*/
e









/* イベントフラグ管理情報 */
typedef struct st_flgcb
{
    KSSTAT state;  /* イベントフラグ状態 */
    UINT   flgptn; /* イベントフラグ値 */
} FLGCB;

/* セマフォ管理情報 */
typedef struct semaphore_control_block
{
    KSSTAT state;  /* セマフォ状態 */
    INT    semcnt; /* セマフォ値 */
    INT    maxsem; /* セマフォ最大値 */
} SEMCB;

/* OSメイン関数 */
extern int main( void );

/* ユーザーメイン関数 */
extern int usermain( void );

#endif
/********************************************************/
/* EOF                                                  */
/********************************************************/
