/* uart_reg.h                                           */
/********************************************************/
/* object    | UARTレジスタアドレス                     */
/* abstract  | rp24専用UARTアドレス                     */
/* edit his  | 2026/01/24 新規作成                      */
/*           |                                          */
/********************************************************/
#ifndef UART_REG_H
#define UART_REG_H

/********************************************************/
/* インクルード                                         */
/********************************************************/
#include "./base_adr.h"

/********************************************************/
/* レジスタ定義マクロ                                   */
/********************************************************/
/* UART */
#define UART0_BASE              0x40034000
#define UART1_BASE              0x40038000

#define UARTx_DR                (0x000)
#define UARTx_FR                (0x018)
#define UARTx_IBRD              (0x024)
#define UARTx_FBRD              (0x028)
#define UARTx_LCR_H             (0x02C)
#define UARTx_CR                (0x030)

#define UART_CR_RXE             (1<<9)
#define UART_CR_TXE             (1<<8)
#define UART_CR_EN              (1<<0)
#define UART_FR_TXFF            (1<<5)


#endif  /* UART_REG_H */
/********************************************************/
/* EOF                                                  */
/********************************************************/
