/* context.c                                            */
/********************************************************/
/* object    | カーネル-コンテキスト                    */
/* abstract  | コンテキスト管理                         */
/* edit his  | 2025/12/17 新規作成                      */
/*           |                                          */
/********************************************************/
/********************************************************/
/* インクルード                                         */
/********************************************************/
#include <typedef.h>
#include <sysdef.h>
#include <syslib.h>
#include <knldef.h>

/********************************************************/
/* 外部公開定義                                         */
/********************************************************/
/* スタック上の実行コンテキスト情報 */
typedef struct {
    u4	r_[8];      /* R4-R11 レジスタの値（例外処理により退避） */
    u4	r[4];       /* R0-R3 レジスタの値*/
    u4	ip;	        /* R12 レジスタの値*/
    u4	lr;         /* lr レジスタの値 */
    u4	pc;         /* pc レジスタの値 */
    u4	xpsr;       /* xpsr レジスタの値 */
} StackFrame;

/* 初期実行コンテキストの作成 */
void *make_context( u4 *sp, UINT ssize, void (*fp)())
{
    StackFrame	*sfp;

    /* スタック上の実行コンテクスト情報へのポインタをsfpに設定 */
    sfp = (StackFrame*)((u4)sp + ssize);
    sfp--;

    /* 実行コンテキスト情報の初期化 */
    sfp->xpsr       = 0x01000000;
    sfp->pc         = (u4)fp & ~0x00000001UL;

    return (void*)sfp;
}

/********************************************************/
/* EOF                                                  */
/********************************************************/
