/* base_adr.h                                           */
/********************************************************/
/* object    | ベースレジスタアドレス                   */
/* abstract  | rp24専用ベースアドレス                   */
/* edit his  | 2026/01/24 新規作成                      */
/*           | vector_tblで主に使用                     */
/********************************************************/
#ifndef BASE_ADR_H
#define BASE_ADR_H

/********************************************************/
/* レジスタ定義マクロ                                   */
/********************************************************/
/* メモリ関連ベースアドレス定義 */
#define SRAM_START              (0x20000000)
#define SRAM_SIZE               (256*1024)
#define	INITIAL_SP              (SRAM_START + SRAM_SIZE)

#endif  /* SYSDEF_H */
/********************************************************/
/* EOF                                                  */
/********************************************************/
