/* nivc_reg.h                                           */
/********************************************************/
/* object    | NIVCレジスタ定義                         */
/* abstract  | rp24専用NIVCレジスタ定義                 */
/* edit his  | 2026/01/25 新規作成                      */
/*           | reset_hdrで主に使用                      */
/********************************************************/
#ifndef NIVC_REG_H
#define NIVC_REG_H

/********************************************************/
/* レジスタ定義マクロ                                   */
/********************************************************/
/* NVIC レジスタ */
#define SCB_SHPR3               (0xE000ED20)

#define	INTLEVEL_0              (0x00)
#define	INTLEVEL_1              (0x40)
#define	INTLEVEL_2              (0x80)
#define	INTLEVEL_3              (0xC0)

#endif  /* NIVC_REG_H */
/********************************************************/
/* EOF                                                  */
/********************************************************/
