/* reset_reg.h                                          */
/********************************************************/
/* object    | リセットレジスタアドレス                 */
/* abstract  | rp24専用リセットアドレス                 */
/* edit his  | 2026/01/24 新規作成                      */
/*           | reset_hdrで使用                          */
/********************************************************/
#ifndef RESET_REG_H
#define RESET_REG_H

/********************************************************/
/* インクルード                                         */
/********************************************************/
#include "./base_adr.h"

/********************************************************/
/* レジスタ定義マクロ                                   */
/********************************************************/

/* Reset Controler */
#define RESETS_BASE             0x4000C000
#define RESETS_RESET            (RESETS_BASE+0x0)
#define RESETS_WDSEL            (RESETS_BASE+0x4)
#define RESETS_RESET_DONE       (RESETS_BASE+0x8)

#define RESETS_RESET_ADC        (0x00000001)
#define RESETS_RESET_I2C0       (0x00000008)
#define RESETS_RESET_I2C1       (0x00000010)


#endif  /* RESET_REG_H */
/********************************************************/
/* EOF                                                  */
/********************************************************/
