/* conv_drv.h                                           */
/********************************************************/
/* object    | 関数境界                                 */
/* abstract  | static inlineでsac定義                   */
/* edit his  | 2026/01/21 新規作成                      */
/*           |                                          */
/********************************************************/

/********************************************************/
/* ヘッダーインクルード                                 */
/********************************************************/

/********************************************************/
/* 外部公開関数宣言                                     */
/********************************************************/
/********************************************************/
/* 関数   | vdg_firstbtn_pushsts( void )                */
/* 説明   | 第一ボタンインライン関数                    */
/* 引数   | なし                                        */
/* 戻り値 | u1                                          */
/********************************************************/
static inline u1 vdg_firstbtn_pushsts(void)
{
    return rp24.firstbtn.push();
}

/********************************************************/
/* 関数   | vdg_secondbtn_pushsts( void )               */
/* 説明   | 第二ボタンインライン関数                    */
/* 引数   | なし                                        */
/* 戻り値 | u1                                          */
/********************************************************/
static inline u1 vdg_secondbtn_pushsts(void)
{
    return rp24.secondbtn.push();
}

/********************************************************/
/* 関数   | vdg_thirdbtn_pushsts( void )                */
/* 説明   | 第三ボタンインライン関数                    */
/* 引数   | なし                                        */
/* 戻り値 | u1                                          */
/********************************************************/
static inline u1 vdg_thirdbtn_pushsts(void)
{
    return rp24.thirdbtn.push();
}

/********************************************************/
/* 関数   | vdg_fourthbtn_pushsts( void )               */
/* 説明   | 第四ボタンインライン関数                    */
/* 引数   | なし                                        */
/* 戻り値 | u1                                          */
/********************************************************/
static inline u1 vdg_fourthbtn_pushsts(void)
{
    return rp24.fourthbtn.push();
}

/********************************************************/
/* 関数   | vdg_firstled_liton( void )                  */
/* 説明   | 第一LEDインライン関数                       */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
static inline void vdg_firstled_liton(void)
{
    rp24.firstled.on();
}

/********************************************************/
/* 関数   | vdg_firstled_litoff( void )                 */
/* 説明   | 第一LEDインライン関数                       */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
static inline void vdg_firstled_litoff(void)
{
    rp24.firstled.off();
}

/********************************************************/
/* 関数   | vdg_secondled_liton( void )                 */
/* 説明   | 第二LEDインライン関数                       */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
static inline void vdg_secondled_liton(void)
{
    rp24.secondled.on();
}

/********************************************************/
/* 関数   | vdg_secondled_litoff( void )                */
/* 説明   | 第二LEDインライン関数                       */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
static inline void vdg_secondled_litoff(void)
{
    rp24.secondled.off();
}

/********************************************************/
/* 関数   | vdg_thirdled_liton( void )                  */
/* 説明   | 第三LEDインライン関数                       */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
static inline void vdg_thirdled_liton(void)
{
    rp24.thirdled.on();
}

/********************************************************/
/* 関数   | vdg_thirdled_litoff( void )                 */
/* 説明   | 第三LEDインライン関数                       */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
static inline void vdg_thirdled_litoff(void)
{
    rp24.thirdled.off();
}

/********************************************************/
/* 関数   | vdg_fourthled_liton( void )                 */
/* 説明   | 第四LEDインライン関数                       */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
static inline void vdg_fourthled_liton(void)
{
    rp24.fourthled.on();
}

/********************************************************/
/* 関数   | vdg_fourthled_litoff( void )                */
/* 説明   | 第四LEDインライン関数                       */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
static inline void vdg_fourthled_litoff(void)
{
    rp24.fourthled.off();
}

/********************************************************/
/* EOF                                                  */
/********************************************************/