/* systick_reg.h                                        */
/********************************************************/
/* object    | systickレジスタアドレス                  */
/* abstract  | rp24専用sistickアドレス                  */
/* edit his  | 2026/01/25 新規作成                      */
/*           |                                          */
/********************************************************/
#ifndef SYSTICK_REG_H
#define SYSTICK_REG_H

/********************************************************/
/* インクルード                                         */
/********************************************************/
#include "./base_adr.h"

/********************************************************/
/* レジスタ定義マクロ                                   */
/********************************************************/
/* SysTick レジスタ */
#define SYST_CSR                (0xE000E010)
#define SYST_RVR                (0xE000E014)
#define SYST_CVR                (0xE000E018)

#define SYST_CSR_COUNTFLAG      (1<<16)
#define SYST_CSR_CLKSOURCE      (1<<2)
#define SYST_CSR_TICKINT        (1<<1)
#define SYST_CSR_ENABLE	        (1<<0)


#endif  /* SYSTICK_REG_H */
/********************************************************/
/* EOF                                                  */
/********************************************************/
