/* scheduler.c                                          */
/********************************************************/
/* object    | スケジューラー                           */
/* abstract  | 次実行のタスクの決定                     */
/* edit his  | 2025/12/22 テンプレート作成              */
/*           |                                          */
/********************************************************/
/********************************************************/
/* ヘッダーインクルード                                 */
/********************************************************/
#include <rp24knl.h>
#include <knldef.h> 

/********************************************************/
/* 内部公開マクロ                                       */
/********************************************************/
/* #define  u1g_SAMPLE_VAL                              */

/********************************************************/
/* 外部公開変数                                         */
/********************************************************/
/* u1 u1g_sample_val                                    */
/* 優先度ごとのReadyキューの配列 */
TCB *ready_queue[CNF_MAX_TSKPRI];

/* 資源占用中のタスク */
TCB *cur_task;

/* 次のタスク */
TCB *sche_task;

/* ディスパッチ禁止フラグ */
u4 disp_running;

/********************************************************/
/* 内部公開変数                                         */
/********************************************************/

/********************************************************/
/* 外部公開関数定義                                     */
/********************************************************/

/********************************************************/
/* 関数   | void scheduler( void )                      */
/* 説明   | タスクのスケジューリング                    */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
void scheduler( void )
{
    INT i;

    /* 優先度が最も高いREADYタスクを探す */
    for(i = 0; i < CNF_MAX_TSKPRI; i++)
    {
        if(ready_queue[i] != NULL)
        {
            break;
        }
    }

    /* タスクを次の候補にする */
    if(i < CNF_MAX_TSKPRI)
    {
        sche_task = ready_queue[i];
    }
    /* 実行可能タスクなし */
    else
    {
        sche_task = NULL;
    }

    /* 同じタスクでなく，ディスパッチ禁止中でない場合 */
    /* 実際にタスクを切り替える */
    if((sche_task != cur_task)
      &&(!disp_running))
    {
        dispatch();
    }
}

/********************************************************/
/* EOF                                                  */
/********************************************************/
