/* task_queue.c                                         */
/********************************************************/
/* object    | タスクの待ち行列操作関数                 */
/* abstract  | タスクの待ち行列操作関数定義             */
/* edit his  | 2025/12/23 テンプレート作成              */
/*           |                                          */
/********************************************************/
/********************************************************/
/* ヘッダーインクルード                                 */
/********************************************************/
#include <rp24knl.h>
#include <knldef.h> 

/********************************************************/
/* 外部公開関数定義                                     */
/********************************************************/

/********************************************************/
/* 関数   | void tqueue_add_enrty( TCB **queue,         */
/*        | TCB *tcb )                                  */
/* 説明   | エントリ追加関数                            */
/* 引数   | TCB **queue, TCB *tcb                       */
/* 戻り値 | semid                                       */
/********************************************************/
void tqueue_add_entry( TCB **queue, TCB *tcb )
{
    TCB *queue_end;  /* 現在キューの末尾を示す */
    
    /* キューが空のとき */
    if(*queue == NULL)
    {
        *queue     = tcb;
        tcb -> pre = tcb;
    }
    else
    {
        /* 末尾TCBをqueue_endに引き当て */
        queue_end         = (*queue) -> pre;
        queue_end -> next = tcb;
        /* 末尾の次に新しいtcbを接続する */
        tcb -> pre        = queue_end;
        /* 新しいtcbの前は元の末尾にする */
        (*queue) -> pre   = tcb;
    }
    /* 新しいtcbは必ず末尾のためnextはNULL */
    tcb -> next = NULL;
}

/********************************************************/
/* 関数   | void tqueue_remove_top( TCB **queue )       */
/* 説明   | 先頭エントリ削除関数                        */
/* 引数   | TCB **queue                                 */
/* 戻り値 | err                                         */
/********************************************************/
void tqueue_remove_top( TCB **queue )
{
    TCB *top;

    /* 空かどうかチェックし，該当の場合は何もせず終了 */
    if(*queue == NULL)
    {
        return;
    }
    top = *queue;
    
    /* キューの先頭を一つ後ろへずらす */
    *queue = top -> next;

    /* 要素がある場合 */
    if(*queue != NULL)
    {
        /* 新しい先頭にも正しい末尾ポインタを渡す． */
        (*queue) -> pre = top -> pre;
    }
}

/********************************************************/
/* 関数   | void tqueue_remove_entry (TCB **queue,      */
/*        | TCB *tcb )                                  */
/* 説明   | 指定エントリ削除関数                        */
/* 引数   | TCB **queue, TCB *tcb                       */
/* 戻り値 | なし                                        */
/********************************************************/
void tqueue_remove_entry( TCB **queue, TCB *tcb )
{
    if(*queue == tcb)
    {
        tqueue_remove_top(queue);

    }
    else
    {
        (tcb -> pre) -> next = tcb -> next;
        if(tcb -> next != NULL)
        {
            (tcb -> next) -> pre = tcb -> pre;
        }
        else
        {
            (*queue) -> pre = tcb -> pre;
        }
    }
}

/********************************************************/
/* EOF                                                  */
/********************************************************/
