/*  os_flg.h                                            */
/********************************************************/
/* object    | OSフラグ定義                             */
/* edit his  | 2026/01/26 新規作成                      */
/*           |                                          */
/********************************************************/
#ifndef OS_FLG_H
#define OS_FLG_H

/********************************************************/
/* インクルード                                        */
/********************************************************/


/********************************************************/
/* 外部公開定義                                         */
/********************************************************/
/* イベントフラグ生成情報 */
typedef struct t_cflg
{
    ATR    flgatr;  /* イベントフラグ属性 */
    UINT   iflgptn; /* イベントフラグ初期値 */
} T_CFLG;


/* イベントフラグAPI */
ID tk_cre_flg( const T_CFLG *pk_cflg );
ER tk_set_flg( ID flgid, UINT setptn );
ER tk_clr_flg( ID flgid, UINT clrptn );
ER tk_wai_flg( ID flgid, UINT waiptn, UINT wfmode, UINT *p_flgptn, TMO tmout );

#endif
/********************************************************/
/* EOF                                                  */
/********************************************************/
