/*  os_sem.h                                            */
/********************************************************/
/* object    | OSセマフォ定義                           */
/* edit his  | 2026/01/26 新規作成                      */
/*           | semaphoreで使用．usermainで初期化        */
/********************************************************/
#ifndef OS_SEM_H
#define OS_SEM_H

/********************************************************/
/* インクルード                                        */
/********************************************************/


/********************************************************/
/* 外部公開定義                                         */
/********************************************************/
/* セマフォ生成情報 */
typedef struct t_csem
{
    ATR    sematr;  /* セマフォ属性 */
    INT    isemcnt; /* セマフォ資源数の初期値 */
    INT    maxsem;  /* セマフォ資源数最大値 */
} T_CSEM;

/* セマフォAPI */
ID tk_cre_sem( const T_CSEM *pk_csem );
ER tk_sig_sem( ID semid, INT cnt );
ER tk_wai_sem( ID semid, INT cnt, TMO tmout );

#endif
/********************************************************/
/* EOF                                                  */
/********************************************************/
