/*  os_types.h                                          */
/********************************************************/
/* object    | OS共通定義                               */
/* edit his  | 2026/01/26 新規作成                      */
/*           | eventflag,semaphoreなどで使用            */
/********************************************************/
#ifndef OS_TYPES_H
#define OS_TYPES_H

/********************************************************/
/* インクルード                                        */
/********************************************************/


/********************************************************/
/* 外部公開定義                                         */
/********************************************************/

/* タイムアウト時間 */
#define TMO_POL    (0)
#define TMO_FEVR   (-1)

#define TWF_ANDW     0x00000000U /* AND待ち */
#define TWF_ORW      0x00000001U /* OR待ち */
#define TWF_CLR      0x00000010U /* 全ビットクリア */
#define TWF_BITCLR   0x00000020U /* 条件ビットクリア */

/* タスクの待ち属性 */
#define TA_TFIFO     0x00000000 /* 待機をFIFO管理 */
#define TA_TPRI      0x00000001 /* 待機を優先度管理 */
#define TA_FIRST     0x00000000 /* 待機行列タスク優先 */
#define TA_CNT       0x00000002 /* 要求数少タスク優先 */
#define TA_WSGL      0x00000000 /* 複数タスク待機禁止 */
#define TA_WMUL      0x00000008 /* 複数タスク待機許可 */

#endif
/********************************************************/
/* EOF                                                  */
/********************************************************/
