/*  os_task.h                                           */
/********************************************************/
/* object    | OSタスク定義                             */
/* edit his  | 2026/01/26 新規作成                      */
/*           | task_mangeで使用．inittsk,usermain初期化 */
/********************************************************/
#ifndef OS_TASKS_H
#define OS_TASKS_H

/********************************************************/
/* インクルード                                        */
/********************************************************/


/********************************************************/
/* 外部公開定義                                         */
/********************************************************/
/* タスク生成情報 */
typedef struct
{
    ATR    tskatr;   /* タスク属性 */
    FP     task;     /* タスク起動アドレス */
    PRI    itskpri;  /* タスク優先度 */
    SZ     stksz;    /* スタックサイズ */
    void   *bufptr;   /* スタックバッファポイント */
} T_CTSK;

/* タスク属性 */
#define TA_HLNG      0x00000001 /* 高級言語記述 */
#define TA_USERBUF   0x00000020 /* ユーザ指定領域 */
#define TA_RNG0      0x00000000 /* 保護レベル０ */
#define TA_RNG1      0x00000100 /* 保護レベル１ */
#define TA_RNG2      0x00000200 /* 保護レベル２ */
#define TA_RNG3      0x00000300 /* 保護レベル３ */


/* タスク管理API */
ID tk_cre_tsk( const T_CTSK *pk_ctsk );
ER tk_sta_tsk( ID tskid, INT stacd );
void tk_ext_tsk( void );

/* タスク付属同期API */
ER tk_dly_tsk( RELTIM dlytim );
ER tk_slp_tsk( TMO tmout );
ER tk_wup_tsk( ID tskid );


#endif
/********************************************************/
/* EOF                                                  */
/********************************************************/
